import 'package:yemenshabab/data/const_info/info_model.dart';

class DataSafety {
  static InfoModel ar = InfoModel(
    header: "سياسة أمان البيانات",
    dataModel: [
      DataModel(
        header: "نظرة عامة",
        description:
            "في يمن شباب، نولي أولوية قصوى لأمان وخصوصية بيانات مستخدمينا. يوضح هذا القسم أنواع البيانات التي نجمعها وكيفية استخدامها والإجراءات التي نتخذها لحمايتها.",
      ),
      DataModel(
        header: "جمع البيانات",
        nested: [
          DataModel(
            header: "البيانات الشخصية",
            description:
                "لا يقوم تطبيقنا بجمع أو تخزين البيانات الشخصية، مثل الأسماء أو عناوين البريد الإلكتروني أو أرقام الهاتف. لا يُطلب من المستخدمين إنشاء حساب أو تقديم معلومات شخصية للوصول إلى المحتوى.",
          ),
          DataModel(
            header: "البيانات غير الشخصية",
            description:
                "أثناء استخدام تطبيقنا، قد نجمع بيانات غير شخصية لا تحدد هويتك بشكل مباشر. يتضمن ذلك:",
            dataList: [
              DataList(
                header: "معلومات الجهاز:",
                description: "نوع الجهاز ونظام التشغيل ومعرفات الجهاز الفريدة.",
              ),
              DataList(
                header: "بيانات الاستخدام",
                description:
                    "معلومات حول كيفية تفاعلك مع تطبيقنا، بما في ذلك الميزات التي تستخدمها والمحتوى الذي تشاهده.",
              ),
            ],
          ),
        ],
      ),
      DataModel(
        header: "استخدام البيانات",
        description:
            "تُستخدم البيانات غير الشخصية التي نجمعها للأغراض التالية فقط: ",
        dataList: [
          DataList(
            header: "أداء التطبيق:",
            description: "لتحسين وظيفة وأداء تطبيقنا.",
          ),
          DataList(
            header: "تخصيص المحتوى:",
            description: "لتقديم محتوى ذي صلة وتعزيز تجربة المستخدم.",
          ),
          DataList(
            header: "التحليلات:",
            description:
                "لتحليل الاتجاهات وأنماط الاستخدام لفهم سلوك وتفضيلات المستخدمين.",
          ),
        ],
      ),
      DataModel(
        header: "مشاركة البيانات",
        description:
            "لا نقوم بمشاركة أو بيع أو تأجير بيانات المستخدم لطرف ثالث. ومع ذلك، قد نشارك البيانات غير الشخصية مع مزودي الخدمة من الأطراف الثالثة الذين يساعدوننا في تشغيل التطبيق، بشرط أن يلتزموا بلوائح حماية البيانات وألا يسئوا استخدام المعلومات.",
      ),
      DataModel(
        header: "أمان البيانات",
        description:
            "نقوم بتنفيذ تدابير أمنية تتماشى مع معايير الصناعة لحماية البيانات التي نجمعها من الوصول غير المصرح به أو التعديل أو التدمير. يشمل ذلك التشفير وبروتوكولات الخوادم الآمنة. ومع ذلك، يرجى ملاحظة أن أي طريقة لنقل البيانات إلكترونيًا أو تخزينها ليست آمنة بنسبة 100%.",
      ),
      DataModel(
        header: "أمان بيانات الأطفال",
        description:
            "تطبيقنا غير مخصص للأطفال دون سن 16 عامًا. نحن لا نجمع بيانات من الأطفال دون هذا العمر عمدًا. إذا اكتشفنا أننا جمعنا مثل هذه البيانات عن غير قصد، فسنقوم باتخاذ خطوات فورية لحذفها.",
      ),
      DataModel(
        header: "حقوق المستخدمين والتحكم",
        description:
            "على الرغم من أننا لا نجمع بيانات شخصية، فقد يتمتع المستخدمون بحقوق معينة بموجب قوانين الخصوصية المعمول بها، بما في ذلك الحق في الوصول إلى بياناتهم أو تصحيحها أو حذفها. إذا كان لديك أي مخاوف أو طلبات بخصوص بياناتك، يرجى الاتصال بنا على",
        link: LinkData(
          title: "info@yemenshabab.net",
          url: "mailto:info@yemenshabab.net",
        ),
      ),
      DataModel(
        header: "تغييرات على سياسة أمان البيانات",
        description:
            "قد نقوم بتحديث قسم أمان البيانات هذا من وقت لآخر لتعكس التغييرات في ممارساتنا أو المتطلبات القانونية. نشجعك على مراجعة هذا القسم دوريًا للحصول على أحدث المعلومات حول ممارسات التعامل مع البيانات لدينا.",
      ),
      DataModel(
        header: "معلومات الاتصال",
        description:
            " لأي أسئلة أو مخاوف بخصوص أمان البيانات، يرجى الاتصال بنا على:\nيمن شباب\n",
        link: LinkData(
          title: "info@yemenshabab.net",
          url: "mailto:info@yemenshabab.net",
        ),
      ),
    ],
  );
  static InfoModel en = InfoModel(
    header: "header",
    dataModel: [],
  );
}
